#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```terraform

data.aws_subnet.tech_subnetes: Reading...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_eks_cluster.tech will be created
  + resource "aws_eks_cluster" "tech" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + cluster_id            = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "tech"
      + platform_version      = (known after apply)
      + role_arn              = "arn:aws:iam::019248244455:role/LabRole"
      + status                = (known after apply)
      + tags_all              = (known after apply)
      + version               = (known after apply)

      + kubernetes_network_config (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + subnet_ids                = [
              + "subnet-00251cca3661eab7c",
              + "subnet-0b8ce7688687ab745",
              + "subnet-0b9190e6af5d60aa2",
              + "subnet-0ce0b9c2470f397e4",
              + "subnet-0fe8bd1b60c41c998",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # aws_eks_node_group.techNode will be created
  + resource "aws_eks_node_group" "techNode" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "tech"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.small",
        ]
      + node_group_name        = "techNode"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::019248244455:role/LabRole"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-00251cca3661eab7c",
          + "subnet-0b8ce7688687ab745",
          + "subnet-0b9190e6af5d60aa2",
          + "subnet-0ce0b9c2470f397e4",
          + "subnet-0fe8bd1b60c41c998",
        ]
      + tags_all               = (known after apply)
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 1
          + max_size     = 1
          + min_size     = 1
        }

      + update_config {
          + max_unavailable = 1
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + endpoint                              = (known after apply)
  + kubeconfig-certificate-authority-data = (known after apply)

```

</details>

*Pushed by: @CarlaCCP, Action: `pull_request`*